/=#
#include "VFR.uni"
//----------------------------------------------------------------------------
// AAEON RTC SMM
//----------------------------------------------------------------------------

#string STR_ENABLED                             #language eng "Enabled"
#string STR_DISABLED                            #language eng "Disabled"

#string STR_WAKE_ON_RTC_PROMPT     	            #language eng "System Wake On RTC"
#string STR_WAKE_ON_RTC_PROMPT_HELP             #language eng "By Date: System will wake on the day with hr::min::sec specified./n By Weekday: System will wake on the enabled weekday with hr::min::sec specified./n Bypass: BIOS will not control RTC wake function"
#string STR_WAKE_DISABLE		                #language eng "Disabled"
#string STR_WAKE_DYNAMIC		                #language eng "Dynamic Time"
#string STR_WAKE_BY_DATE		                #language eng "By Date"
#string STR_WAKE_BY_WEEKDAY		                #language eng "By Weekday"
#string STR_WAKE_BYPASS		     	            #language eng "Bypass"

#string STR_RTC_WAKEUP_HOUR_PROMPT              #language eng "  Wake up hour"
#string STR_RTC_HOUR_HELP                       #language eng "select 0-23 For example enter 3 for 3am and 15 for 3pm"
#string STR_RTC_WAKEUP_MINUTE_PROMPT            #language eng "  Wake up minute"
#string STR_RTC_WAKEUP_MINUTE_INCREASE_PROMPT   #language eng "  Wake up minute increase"
#string STR_RTC_WAKEUP_SECOND_PROMPT            #language eng "  Wake up second"
#string STR_RTC_DAY_HELP                        #language eng "Select 0 for daily system wake up 1-31 for which day of the month that you would like the system to wake up"
#string STR_TIME_MINUTE_HELP                    #language eng  "0 - 59"
#string STR_TIME_MINUTE_INCREASE_HELP           #language eng  "1 - 5"
#string STR_TIME_SECOND_HELP                    #language eng  "0 - 59"
#string STR_RTC_WAKEUP_DAY_PROMPT               #language eng "  Wake up day"
#string STR_RTC_DAY_HELP                        #language eng "Select 0 for daily system wake up, 1-31 for which day of the month that you would like the system to wake up"

#string STR_RTC_DAY_SUNDAY                      #language eng "  Sunday"
#string STR_RTC_DAY_MONDAY                      #language eng "  Monday"
#string STR_RTC_DAY_TUESDAY                     #language eng "  Tuesday"
#string STR_RTC_DAY_WEDNESDAY                   #language eng "  Wednesday"
#string STR_RTC_DAY_THURSDAY                    #language eng "  Thursday"
#string STR_RTC_DAY_FRIDAY                      #language eng "  Friday"
#string STR_RTC_DAY_SATURDAY                    #language eng "  Saturday"
#string STR_RTC_WEEKDAY_HELP                    #language eng "Enable or disable RTC wake up on weekday"